[
  {
    "id": 1,
    "title": "Apprentissage Python",
    "type": "Formation en ligne",
    "realHours": 12,
    "valuableHours": 10,
    "imageUrl": "/images/apprenezLesBasesDePython/4.png",
    "description": "Cours Open Classroom, en vue de maîtriser Python",
    "fullDescription": "J'ai suivi une formation en ligne sur OpenClassrooms pour apprendre les bases de Python. Cette opportunité m'a permis d'acquérir une solide compréhension des fondements de la programmation, tels que les variables, les structures conditionnelles, les boucles et la manipulation de fichiers. En travaillant sur des exercices pratiques, j'ai renforcé ma logique algorithmique et mon autonomie dans la résolution de problèmes. Cet apprentissage s'inscrit parfaitement dans mon projet professionnel, car la maîtrise de Python est un atout majeur pour le développement d'applications, l'analyse de données et l'automatisation de tâches en entreprise. Cette expérience a enrichi mon profil polyvalent recherché sur le marché de l'emploi.",
    "images": [
      {
        "src": "/images/apprenezLesBasesDePython/1.png",
        "alt": "Mon Certificat",
        "title": "Mon Certificat de formation"
      },
      {
        "src": "/images/apprenezLesBasesDePython/2.png",
        "alt": "Cours en ligne",
        "title": "Cours en ligne"
      },
      {
        "src": "/images/apprenezLesBasesDePython/3.png",
        "alt": "Cours en ligne",
        "title": "Cours en ligne"
      },

      {
        "src": "/images/apprenezLesBasesDePython/4.png",
        "alt": "Python",
        "title": "Python"
      }
    ]
  },
  {
    "id": 2,
    "title": "Cyber Security Challenge 2024",
    "type": "Hackathon",
    "realHours": 48,
    "valuableHours": 10,
    "imageUrl": "/images/cyberSecurityChallenge/3.png",
    "description": "Participation à un événement de capture du drapeau (CTF) en équipe.",
    "fullDescription": "J'ai participé au Cyber Security Challenge Belgium 2024, un hackathon intense de type Capture The Flag (CTF) en équipe. Cet événement m'a plongé dans des défis concrets de cybersécurité : exploitation de failles, cryptographie, forensic, et reverse engineering. J'ai pu mettre en pratique mes compétences techniques tout en développant mon esprit d'équipe et ma gestion du stress. Cette expérience m'a conforté dans l'idée que la cybersécurité est un domaine qui me passionne et que je souhaite approfondir dans mon futur professionnel. Participer à un tel événement m'a aussi permis de comprendre les attentes du marché du travail en matière de sécurité informatique.",
    "images": [
      {
        "src": "/images/cyberSecurityChallenge/1.png",
        "alt": "Ctf Profile",
        "title": "Mon Profil avec notre nom d'équipe : Les Mangeurs de Cartes Graphiques"
      },
      {
        "src": "/images/cyberSecurityChallenge/2.png",
        "alt": "LeaderBoard",
        "title": "Position de notre équipe dans le classement"
      },
      {
        "src": "/images/cyberSecurityChallenge/3.png",
        "alt": "Cyber Security Challenge 2024",
        "title": "Cyber Security Challenge 2024"
      },
      {
        "src": "/images/cyberSecurityChallenge/4.jpg",
        "alt": "Photo de l'événement",
        "title": "Photo de l'événement"
      }
    ]
  },
  {
    "id": 3,
    "title": "Tutorat Mathématiques",
    "type": "Enseignement",
    "realHours": 9.75,
    "valuableHours": 9.75,
    "imageUrl": "/images/tutorat/1.jpg",
    "description": "Tutorat de Mathématiques pour des élèves de l'ephec",
    "fullDescription": "J'ai eu l'opportunité d'assurer du tutorat en mathématiques pour des étudiants de l'EPHEC. Cette expérience a été extrêmement enrichissante, car elle m'a permis de consolider mes propres compétences tout en apprenant à vulgariser des concepts complexes. J'ai amélioré ma capacité à écouter, à diagnostiquer les difficultés rencontrées par les étudiants, et à adapter mes explications en fonction de leurs besoins. Cette activité a directement contribué à renforcer mes compétences en communication, indispensables dans le milieu professionnel, notamment pour travailler efficacement en équipe ou pour expliquer des concepts techniques à des non-spécialistes.",
    "images": [
      {
        "src": "/images/tutorat/2.png",
        "alt": "Attestation de tutorat",
        "title": "Mon Attestation de tutorat"
      },
      {
        "src": "/images/tutorat/3.png",
        "alt": "Prestations",
        "title": "Toutes mes prestations de tutorat"
      },
      {
        "src": "/images/tutorat/4.png",
        "alt": "Offre de tutorat",
        "title": "Mes offres de tutorat en Anglais et Mathématiques"
      },
      {
        "src": "/images/tutorat/1.jpg",
        "alt": "Professeur",
        "title": "Professeur"
      }
    ]
  },
  {
    "id": 4,
    "title": "Création de mon portfolio",
    "type": "Développement Web",
    "realHours": 100,
    "valuableHours": 10,
    "imageUrl": "/images/portFolioThreeJS/3.png",
    "description": "Création de mon portfolio en THREE.JS",
    "fullDescription": "Dans le cadre de mon projet personnel, j'ai entrepris de créer mon portfolio interactif en utilisant Three.js et Blender. Ce travail m'a permis de développer mes compétences en modélisation 3D, en programmation WebGL et en animation d'objets 3D. J'ai suivi la formation Three.js Journey de Bruno Simon pour maîtriser cette technologie complexe. Cette expérience a été l'occasion pour moi de renforcer ma rigueur technique et ma capacité à mener un projet créatif de bout en bout. Mon portfolio est non seulement une vitrine de mes compétences, mais aussi une démonstration concrète de ma capacité à apprendre de nouvelles technologies de manière autonome.",
    "images": [
      {
        "src": "/images/portFolioThreeJS/1.png",
        "alt": "Modèles",
        "title": "Voici les modèles 3D que j'ai créé pour mon portfolio, fait avec Blender. Il va y en avoir plus au fur et à mesure de l'avancement du projet."
      },
      {
        "src": "/images/portFolioThreeJS/2.jpg",
        "alt": "Travail en cours",
        "title": "Le portfolio n'est pas encore disponible"
      },
      {
        "src": "/images/portFolioThreeJS/3.png",
        "alt": "Prototype",
        "title": "Blender Et ThreeJS, les deux outils principaux du portfolio"
      },
      {
        "src": "/images/portFolioThreeJS/4.png",
        "alt": "Formation ThreeJS",
        "title": "ThreeJS Journey: Formation en ligne crée par Bruno Simon que je suis pour créer mon portfolio"
      }
    ]
  },
  {
    "id": 5,
    "title": "Modélisation 3D",
    "type": "Modélisation 3D",
    "realHours": 400,
    "valuableHours": 10,
    "imageUrl": "/images/apprBlender/2.png",
    "description": "Apprentissage & Mise en Pratique de la Modélisation 3D",
    "fullDescription": "Pour développer mes compétences en modélisation 3D, j'ai suivi plusieurs formations sur Blender et réalisé de nombreux projets personnels. Cette activité m'a appris à créer des modèles, à texturer, à gérer l'éclairage et à rendre des scènes réalistes. Au-delà de l'aspect technique, cet apprentissage m'a également permis de travailler ma patience, ma précision et ma sensibilité artistique. Dans le cadre de mon projet professionnel, ces compétences me permettent d'envisager des applications dans la création d'environnements virtuels, le développement de jeux vidéo ou la conception de contenus interactifs.",
    "images": [
      {
        "src": "/images/apprBlender/3.png",
        "alt": "Rendu 3D",
        "title": "L'un de mes premiers rendu sans suivre de tuto"
      },
      {
        "src": "/images/apprBlender/2.png",
        "alt": "Rendu 3D",
        "title": "Un autre rendu 3D dont je suis fier"
      },
      {
        "src": "/images/apprBlender/5.png",
        "alt": "Formation Blender",
        "title": "Une des nombreuses formations que j'ai suivies pour apprendre Blender"
      },
      {
        "src": "/images/apprBlender/4.png",
        "alt": "Recherche",
        "title": "Scène en cours de création, j'en suis à la l'étape de la modélisation"
      }
    ]
  },
  {
    "id": 6,
    "title": "Webinaires : Cybersécurité & IA pour la gestion de projet",
    "type": "Webinaires",
    "realHours": 13,
    "valuableHours": 10,
    "imageUrl": "/images/webinaires/1.png",
    "description": "Webinaires spécialisés en cybersécurité et intelligence artificielle",
    "fullDescription": "Dans le cadre de ma veille technologique, j’ai assisté à plusieurs webinaires techniques portant principalement sur deux domaines stratégiques : la cybersécurité et l’intelligence artificielle appliquée à la gestion de projet. Côté cybersécurité, les sessions m'ont permis de mieux comprendre les vulnérabilités des systèmes d'information, les méthodes de détection d’intrusion (NDR), les risques liés aux mots de passe, les attaques sur les DNS, et les obligations liées à la directive NIS2. En parallèle, j’ai suivi des présentations sur l’usage de l’IA pour automatiser des tâches, documenter des projets IT, et structurer les exigences fonctionnelles. Ces webinaires m'ont permis de renforcer mes connaissances théoriques et d'alimenter mes projets personnels avec des pratiques actuelles du terrain.",
    "images": [
      {
        "src": "/images/webinaires/1.png",
        "alt": "Webinaire",
        "title": "Webinaire"
      },
      {
        "src": "/images/webinaires/2.png",
        "alt": "Webinaire",
        "title": "Les Webinaires aux quels j'ai assisté"
      },
      {
        "src": "/images/webinaires/3.png",
        "alt": "Webinaire",
        "title": "Les Webinaires aux quels j'ai assisté"
      },
      {
        "src": "/images/webinaires/4.png",
        "alt": "Webinaire",
        "title": "Les Webinaires aux quels j'ai assisté"
      }
    ]
  }
]
